In [ ]:
import pandas as pd
import numpy as np


The goal of this exercise is to learn how to compute different types of aggregations on groups. This small DataFrame contains products and prices.

|     |  value | product      |
| --: | -----: | :----------- |
|   0 |  20.45 | table        |
|   1 |  22.89 | chair        |
|   2 |  32.12 | chair        |
|   3 | 111.22 | mobile phone |
|   4 |  33.22 | table        |
|   5 |    100 | mobile phone |
|   6 |  99.99 | table        |

In [11]:
products = np.array(['table', 'chair', 'chair', 'mobile phone', 'table', 'mobile phone', 'table'])
values = np.array([20.45, 22.89, 32.12, 111.22, 33.22, 100, 99.99])
df = pd.DataFrame({
    "value": values,
    "product": products
})
df.head(10)

    value       product
0   20.45         table
1   22.89         chair
2   32.12         chair
3  111.22  mobile phone
4   33.22         table
5  100.00  mobile phone
6   99.99         table

1. Compute the min, max and mean price for each product in one single line of code. The expected output is:

| product      | ('value', 'min') | ('value', 'max') | ('value', 'mean') |
| :----------- | ---------------: | ---------------: | ----------------: |
| chair        |            22.89 |            32.12 |            27.505 |
| mobile phone |              100 |           111.22 |            105.61 |
| table        |            20.45 |            99.99 |             51.22 |

Note: The columns don't have to be MultiIndex

In [12]:
df.groupby('product')['value'].agg(['min', 'max', 'mean'])

                 min     max     mean
product
chair          22.89   32.12   27.505
mobile phone  100.00  111.22  105.610
table          20.45   99.99   51.220